// Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.

// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3.

Console.Clear();
int[,] GenerateDualArr(int nx = 5, int ny = 6)          // Функция генерирует двухмерный массив
{
    int[,] dualArr = new int[nx, ny];
    Random rnd = new Random();
    for (int x = 0; x < nx; x++)
    {
        for (int y = 0; y < ny; y++)
        {
            dualArr[x, y] = rnd.Next(0, 10);
        }
    }
    return dualArr;
}

void PrintArr(int[,] arr)                            // Функция выводит двухмерный массив
{
    for (int x = 0; x < arr.GetLength(0); x++)
    {
        for (int y = 0; y < arr.GetLength(1); y++)
        {
            Console.Write($"{arr[x, y]}\t");
        }
        Console.WriteLine();
    }
}

float [] GetSumOfRows(int[,] arr)                   // Функция возвращает средние значения по столбцам
{
    float[] sums = new float [arr.GetLength(1)];
    for (int y = 0; y < arr.GetLength(1); y++)
    {
        for (int x = 0; x < arr.GetLength(0); x++)
        {
            sums[y] += arr[x, y];
        }
        sums[y] /= arr.GetLength(0);
    }
    return sums;
}

int [,] arr = GenerateDualArr();
PrintArr(arr);
Console.WriteLine("-------------------------------------------");
Console.Write(string.Join("\t", GetSumOfRows(arr)));